app/controllers/articles_controller.rb

	def index
		if params[:category].blank?
			@articles =Article.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@articles= Article.where(category_id: @category_id).order("created_at DESC")
---
SELECT `categories`.* FROM `categories`
SELECT `articles`.* FROM `articles`  ORDER BY created_at DESC
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Technology' LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`category_id` = 2  ORDER BY created_at DESC

	def create
		@article = current_user.articles.build(article_params)
		if @article.save
---
INSERT INTO `articles` (`title`, `content`, `category_id`, `user_id`, `created_at`, `updated_at`) VALUES ('phone', 'good', 2, 1, '2016-10-09 19:40:42', '2016-10-09 19:40:42')

		def find_article
			@article =Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1